tutorials/compressiblePbeTransportFoam/Twenty_three_degree_wedge/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file:
// Export date: 2024-03-24 21:11:36.600689

numberOfSubdomains 2;

method          scotch;
// method          simple;

simpleCoeffs
{
    n               (1 1 2);
    delta           0.001;
}

hierarchicalCoeffs
{
    n               (1 1 2);
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}
